#### AnalysisDisplayStyleVectorArrowheadScale Enumeration

---

|  |
| --- |
| See Also |

Defines arrow head scaling for vector settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleVectorArrowheadScale ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleVectorArrowheadScale ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleVectorArrowheadScale ``` |

# Members

| Member name | Description |
| --- | --- |
| NoScaling |  |
| Length5Percent |  |
| Length10Percent |  |
| Length15Percent |  |
| Length20Percent |  |
| NoArrow |  |

# See Also

Autodesk.Revit.DB.Analysis Namespace